digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
/*
 * CppCore - C++ microprocessor core library
 *
 * Copyright 2012 Axel Burri <axel@tty0.ch>
 * 
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 * 
 */

#ifndef CORE_REG_HPP_INCLUDED
#define CORE_REG_HPP_INCLUDED

//
//  core register definition: wrap bitfields into Register classes
//

//  Pros:
//
//  - uses Register MPL class to wrap the register access. All type
//    checks are performed on register write, AND on register bitfield
//    access.
//
//  - register bitfields are defined as type "static constexpr uint32_t",
//    which is very common, simple and straight forward.
//
//
//  Cons:
//
//  - MPL stype "::value" variable access
//
//
// *** Don't miss the text from previous commit! ***


// Example:
//
// TODO: declaration example
//
// LINKS: 
// "uint_fast16_t": http://en.cppreference.com/w/cpp/types/integer
//
// static void enable(void) {
//   SPIx::CR1::SPE::set()  /* SPI Enable */
// }
//
// void MyFunction() {
//   /* a load() call results in:                                                 */
//   /*                                                                           */
//   /* constexpr volatile T * value_ptr = reinterpret_cast<volatile T *>(addr);  */
//   /* auto reg = *value_ptr;                                                    */
//   /*                                                                           */
//   /* notes:                                                                    */
//   /* - "addr" (constexpr) holds the address of (non-pointer-type) SPIx::CR1    */
//   /* - type "T" is the register type (e.g. uint32_t or uint8_t)                */
//   /* - reg becomes type "volatile uint32_t                                     */
//   /*                                                                           */
//
//   auto reg = SPIx::CR1::load();
//   reg &= SPIx::CR1::SPE::value | SPIx::CR1::CRCNEXT::value | SPIx::CR1::CRCEN::value;
//   SPIx::CR1::store(reg);

//   /* a store() call results in:                                                */
//   /* *value_ptr = reg;                                                         */
// }
//


#include <register.hpp>
#include "../../../common/arm-cortex/core_register.hpp"


////////////////////  PeripheralMemoryMap  ////////////////////


struct PeripheralMemoryMap
{
  static constexpr reg_addr_t PERIPH_BB_BASE        = 0x42000000; /**< Peripheral base address in the alias region   */
  static constexpr reg_addr_t SRAM_BB_BASE          = 0x22000000; /**< SRAM base address in the alias region         */

  static constexpr reg_addr_t SRAM_BASE             = 0x20000000; /**< SRAM base address in the bit-band region         */
  static constexpr reg_addr_t PERIPH_BASE           = 0x40000000; /**< Peripheral base address in the bit-band region   */

  static constexpr reg_addr_t FSMC_R_BASE           = 0xA0000000; /**< FSMC registers base address   */


  static constexpr reg_addr_t APB1PERIPH_BASE       = PERIPH_BASE;
  static constexpr reg_addr_t APB2PERIPH_BASE       = PERIPH_BASE + 0x10000;
  static constexpr reg_addr_t AHBPERIPH_BASE        = PERIPH_BASE + 0x20000;

  static constexpr reg_addr_t TIM2_BASE             = APB1PERIPH_BASE + 0x0000;
  static constexpr reg_addr_t TIM3_BASE             = APB1PERIPH_BASE + 0x0400;
  static constexpr reg_addr_t TIM4_BASE             = APB1PERIPH_BASE + 0x0800;
  static constexpr reg_addr_t TIM5_BASE             = APB1PERIPH_BASE + 0x0C00;
  static constexpr reg_addr_t TIM6_BASE             = APB1PERIPH_BASE + 0x1000;
  static constexpr reg_addr_t TIM7_BASE             = APB1PERIPH_BASE + 0x1400;
  static constexpr reg_addr_t TIM12_BASE            = APB1PERIPH_BASE + 0x1800;
  static constexpr reg_addr_t TIM13_BASE            = APB1PERIPH_BASE + 0x1C00;
  static constexpr reg_addr_t TIM14_BASE            = APB1PERIPH_BASE + 0x2000;
  static constexpr reg_addr_t RTC_BASE              = APB1PERIPH_BASE + 0x2800;
  static constexpr reg_addr_t WWDG_BASE             = APB1PERIPH_BASE + 0x2C00;
  static constexpr reg_addr_t IWDG_BASE             = APB1PERIPH_BASE + 0x3000;
  static constexpr reg_addr_t SPI2_BASE             = APB1PERIPH_BASE + 0x3800;
  static constexpr reg_addr_t SPI3_BASE             = APB1PERIPH_BASE + 0x3C00;
  static constexpr reg_addr_t USART2_BASE           = APB1PERIPH_BASE + 0x4400;
  static constexpr reg_addr_t USART3_BASE           = APB1PERIPH_BASE + 0x4800;
  static constexpr reg_addr_t UART4_BASE            = APB1PERIPH_BASE + 0x4C00;
  static constexpr reg_addr_t UART5_BASE            = APB1PERIPH_BASE + 0x5000;
  static constexpr reg_addr_t I2C1_BASE             = APB1PERIPH_BASE + 0x5400;
  static constexpr reg_addr_t I2C2_BASE             = APB1PERIPH_BASE + 0x5800;
  static constexpr reg_addr_t CAN1_BASE             = APB1PERIPH_BASE + 0x6400;
  static constexpr reg_addr_t CAN2_BASE             = APB1PERIPH_BASE + 0x6800;
  static constexpr reg_addr_t BKP_BASE              = APB1PERIPH_BASE + 0x6C00;
  static constexpr reg_addr_t PWR_BASE              = APB1PERIPH_BASE + 0x7000;
  static constexpr reg_addr_t DAC_BASE              = APB1PERIPH_BASE + 0x7400;
  static constexpr reg_addr_t CEC_BASE              = APB1PERIPH_BASE + 0x7800;

  static constexpr reg_addr_t AFIO_BASE             = APB2PERIPH_BASE + 0x0000;
  static constexpr reg_addr_t EXTI_BASE             = APB2PERIPH_BASE + 0x0400;
  static constexpr reg_addr_t GPIOA_BASE            = APB2PERIPH_BASE + 0x0800;
  static constexpr reg_addr_t GPIOB_BASE            = APB2PERIPH_BASE + 0x0C00;
  static constexpr reg_addr_t GPIOC_BASE            = APB2PERIPH_BASE + 0x1000;
  static constexpr reg_addr_t GPIOD_BASE            = APB2PERIPH_BASE + 0x1400;
  static constexpr reg_addr_t GPIOE_BASE            = APB2PERIPH_BASE + 0x1800;
  static constexpr reg_addr_t GPIOF_BASE            = APB2PERIPH_BASE + 0x1C00;
  static constexpr reg_addr_t GPIOG_BASE            = APB2PERIPH_BASE + 0x2000;
  static constexpr reg_addr_t ADC1_BASE             = APB2PERIPH_BASE + 0x2400;
  static constexpr reg_addr_t ADC2_BASE             = APB2PERIPH_BASE + 0x2800;
  static constexpr reg_addr_t TIM1_BASE             = APB2PERIPH_BASE + 0x2C00;
  static constexpr reg_addr_t SPI1_BASE             = APB2PERIPH_BASE + 0x3000;
  static constexpr reg_addr_t TIM8_BASE             = APB2PERIPH_BASE + 0x3400;
  static constexpr reg_addr_t USART1_BASE           = APB2PERIPH_BASE + 0x3800;
  static constexpr reg_addr_t ADC3_BASE             = APB2PERIPH_BASE + 0x3C00;
  static constexpr reg_addr_t TIM15_BASE            = APB2PERIPH_BASE + 0x4000;
  static constexpr reg_addr_t TIM16_BASE            = APB2PERIPH_BASE + 0x4400;
  static constexpr reg_addr_t TIM17_BASE            = APB2PERIPH_BASE + 0x4800;
  static constexpr reg_addr_t TIM9_BASE             = APB2PERIPH_BASE + 0x4C00;
  static constexpr reg_addr_t TIM10_BASE            = APB2PERIPH_BASE + 0x5000;
  static constexpr reg_addr_t TIM11_BASE            = APB2PERIPH_BASE + 0x5400;

  static constexpr reg_addr_t SDIO_BASE             = PERIPH_BASE + 0x18000;

