digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
  static constexpr reg_addr_t DMA1_BASE             = AHBPERIPH_BASE + 0x0000;
  static constexpr reg_addr_t DMA1_Channel1_BASE    = AHBPERIPH_BASE + 0x0008;
  static constexpr reg_addr_t DMA1_Channel2_BASE    = AHBPERIPH_BASE + 0x001C;
  static constexpr reg_addr_t DMA1_Channel3_BASE    = AHBPERIPH_BASE + 0x0030;
  static constexpr reg_addr_t DMA1_Channel4_BASE    = AHBPERIPH_BASE + 0x0044;
  static constexpr reg_addr_t DMA1_Channel5_BASE    = AHBPERIPH_BASE + 0x0058;
  static constexpr reg_addr_t DMA1_Channel6_BASE    = AHBPERIPH_BASE + 0x006C;
  static constexpr reg_addr_t DMA1_Channel7_BASE    = AHBPERIPH_BASE + 0x0080;
  static constexpr reg_addr_t DMA2_BASE             = AHBPERIPH_BASE + 0x0400;
  static constexpr reg_addr_t DMA2_Channel1_BASE    = AHBPERIPH_BASE + 0x0408;
  static constexpr reg_addr_t DMA2_Channel2_BASE    = AHBPERIPH_BASE + 0x041C;
  static constexpr reg_addr_t DMA2_Channel3_BASE    = AHBPERIPH_BASE + 0x0430;
  static constexpr reg_addr_t DMA2_Channel4_BASE    = AHBPERIPH_BASE + 0x0444;
  static constexpr reg_addr_t DMA2_Channel5_BASE    = AHBPERIPH_BASE + 0x0458;
  static constexpr reg_addr_t RCC_BASE              = AHBPERIPH_BASE + 0x1000;
  static constexpr reg_addr_t CRC_BASE              = AHBPERIPH_BASE + 0x3000;

  static constexpr reg_addr_t FLASH_BASE            = AHBPERIPH_BASE + 0x2000; /**< Flash registers base address      */
  static constexpr reg_addr_t OB_BASE               = 0x1FFFF800;              /**< Flash Option Bytes base address   */

  static constexpr reg_addr_t ETH_BASE              = AHBPERIPH_BASE + 0x8000;
  static constexpr reg_addr_t ETH_MAC_BASE          = ETH_BASE;
  static constexpr reg_addr_t ETH_MMC_BASE          = ETH_BASE + 0x0100;
  static constexpr reg_addr_t ETH_PTP_BASE          = ETH_BASE + 0x0700;
  static constexpr reg_addr_t ETH_DMA_BASE          = ETH_BASE + 0x1000;

  static constexpr reg_addr_t FSMC_Bank1_R_BASE     = FSMC_R_BASE + 0x0000; /**< FSMC Bank1 registers base address    */
  static constexpr reg_addr_t FSMC_Bank1E_R_BASE    = FSMC_R_BASE + 0x0104; /**< FSMC Bank1E registers base address   */
  static constexpr reg_addr_t FSMC_Bank2_R_BASE     = FSMC_R_BASE + 0x0060; /**< FSMC Bank2 registers base address    */
  static constexpr reg_addr_t FSMC_Bank3_R_BASE     = FSMC_R_BASE + 0x0080; /**< FSMC Bank3 registers base address    */
  static constexpr reg_addr_t FSMC_Bank4_R_BASE     = FSMC_R_BASE + 0x00A0; /**< FSMC Bank4 registers base address    */

  static constexpr reg_addr_t DBGMCU_BASE           = 0xE0042000; /**< Debug MCU registers base address   */
};



////////////////////  PeripheralRegister  ////////////////////



namespace Reg {

  static constexpr reg_addr_t PERIPH_BASE = 0x40000000;
  static constexpr reg_addr_t APB1_BASE   = PERIPH_BASE;
  static constexpr reg_addr_t APB2_BASE   = PERIPH_BASE + 0x10000;
  static constexpr reg_addr_t AHB_BASE    = PERIPH_BASE + 0x20000;

  using access = RegisterAccess;


  /**
   * Reset and clock control (RCC)
   */
  class RCC
  {
    static constexpr reg_addr_t reg_base = AHB_BASE + 0x1000;

    /**
     * Clock control register
     */
    template<typename R>
    struct __CR
    : public R
    {
      // TODO: some (!) here are read-only bits
      typedef RegisterBits< R,  0,  1 > HSION;         /**< [ 0: 0] Internal High Speed clock enable        */
      typedef RegisterBits< R,  1,  1 > HSIRDY;        /**< [ 1: 1] Internal High Speed clock ready flag    */
      typedef RegisterBits< R,  3,  5 > HSITRIM;       /**< [ 7: 3] Internal High Speed clock trimming      */
      typedef RegisterBits< R,  8,  8 > HSICAL;        /**< [15: 8] Internal High Speed clock Calibration   */
      typedef RegisterBits< R, 16,  1 > HSEON;         /**< [16:16] External High Speed clock enable        */
      typedef RegisterBits< R, 17,  1 > HSERDY;        /**< [17:17] External High Speed clock ready flag    */
      typedef RegisterBits< R, 18,  1 > HSEBYP;        /**< [18:18] External High Speed clock Bypass        */
      typedef RegisterBits< R, 19,  1 > CSSON;         /**< [19:19] Clock Security System enable            */
      typedef RegisterBits< R, 24,  1 > PLLON;         /**< [24:24] PLL enable                              */
      typedef RegisterBits< R, 25,  1 > PLLRDY;        /**< [25:25] PLL clock ready flag                    */

#ifdef STM32F10X_CL
      typedef RegisterBits< R, 26,  1 > PLL2ON;        /**< [26:26] PLL2 enable             */
      typedef RegisterBits< R, 27,  1 > PLL2RDY;       /**< [27:27] PLL2 clock ready flag   */
      typedef RegisterBits< R, 28,  1 > PLL3ON;        /**< [28:28] PLL3 enable             */
      typedef RegisterBits< R, 29,  1 > PLL3RDY;       /**< [29:29] PLL3 clock ready flag   */
#endif /* STM32F10X_CL */
    };


    /*
     *  Clock configuration register
     */
    template<typename R>
    class __CFGR
    : public R
    {
      /** System clock Switch (Status) */
      template<typename Rb>
      struct __SWx
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > HSI;          /**< 00: HSI selected as system clock   */
        typedef RegisterConst< Rb, 0x1 > HSE;          /**< 01: HSE selected as system clock   */
        typedef RegisterConst< Rb, 0x2 > PLL;          /**< 10: PLL selected as system clock   */
      };

      /** AHB prescaler  */
      template<typename Rb>
      struct __HPRE
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV1;         /**< 0xxx: SYSCLK not divided      */
        typedef RegisterConst< Rb, 0x8 > DIV2;         /**< 1000: SYSCLK divided by 2     */
        typedef RegisterConst< Rb, 0x9 > DIV4;         /**< 1001: SYSCLK divided by 4     */
        typedef RegisterConst< Rb, 0xA > DIV8;         /**< 1010: SYSCLK divided by 8     */
        typedef RegisterConst< Rb, 0xB > DIV16;        /**< 1011: SYSCLK divided by 16    */
        typedef RegisterConst< Rb, 0xC > DIV64;        /**< 1100: SYSCLK divided by 64    */
        typedef RegisterConst< Rb, 0xD > DIV128;       /**< 1101: SYSCLK divided by 128   */
        typedef RegisterConst< Rb, 0xE > DIV256;       /**< 1110: SYSCLK divided by 256   */
        typedef RegisterConst< Rb, 0xF > DIV512;       /**< 1111: SYSCLK divided by 512   */
      };

      /** APB1/2 prescaler  */
      template<typename Rb>
      struct __PPREx
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV1;         /**< 0xx: HCLK not divided     */
        typedef RegisterConst< Rb, 0x4 > DIV2;         /**< 100: HCLK divided by 2    */
        typedef RegisterConst< Rb, 0x5 > DIV4;         /**< 101: HCLK divided by 4    */
        typedef RegisterConst< Rb, 0x6 > DIV8;         /**< 110: HCLK divided by 8    */
        typedef RegisterConst< Rb, 0x7 > DIV16;        /**< 111: HCLK divided by 16   */
      };

