digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
      /** ADC prescaler  */
      template<typename Rb>
      struct __ADCPRE
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV2;         /**< 00: PCLK2 divided by 2   */
        typedef RegisterConst< Rb, 0x1 > DIV4;         /**< 01: PCLK2 divided by 4   */
        typedef RegisterConst< Rb, 0x2 > DIV6;         /**< 10: PCLK2 divided by 6   */
        typedef RegisterConst< Rb, 0x3 > DIV8;         /**< 11: PCLK2 divided by 8   */
      };

      /** PLL entry clock source  */
      template<typename Rb>
      struct __PLLSRC
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > HSI_DIV2;     /**< 00: HSI clock divided by 2 selected as PLL input clock   */
#ifdef STM32F10X_CL
        typedef RegisterConst< Rb, 0x1 > PREDIV1;      /**< 01: Clock from PREDIV1 selected as PLL input clock   */
#else
        typedef RegisterConst< Rb, 0x1 > HSE;          /**< 01: HSE oscillator clock selected as PLL input clock   */
#endif
      };

      /** 
       * - LSB of division factor PREDIV1 (Connectivity Line Devices)
       * - HSE divider for PLL entry (Low-, medium-, high- and XL-density Devices)
       */
      template<typename Rb>
      struct __PLLXTPRE
      : public Rb
      {
#ifdef STM32F10X_CL
        typedef RegisterConst< Rb, 0x0 > PREDIV1;      /**< 00: PREDIV1 clock not divided for PLL entry    */
        typedef RegisterConst< Rb, 0x1 > PREDIV1_DIV2; /**< 01: PREDIV1 clock divided by 2 for PLL entry   */
#else
        typedef RegisterConst< Rb, 0x0 > HSE;          /**< 00: HSE clock not divided    */
        typedef RegisterConst< Rb, 0x1 > HSE_DIV2;     /**< 01: HSE clock divided by 2   */
#endif
      };

      /** PLL multiplication factor  */
      template<typename Rb>
      struct __PLLMUL
      : public Rb
      {
#ifdef STM32F10X_CL
        typedef RegisterConst< Rb, 0x2 > MUL4;         /**< 0010: PLL input clock * 4     */
        typedef RegisterConst< Rb, 0x3 > MUL5;         /**< 0011: PLL input clock * 5     */
        typedef RegisterConst< Rb, 0x4 > MUL6;         /**< 0100: PLL input clock * 6     */
        typedef RegisterConst< Rb, 0x5 > MUL7;         /**< 0101: PLL input clock * 7     */
        typedef RegisterConst< Rb, 0x6 > MUL8;         /**< 0110: PLL input clock * 8     */
        typedef RegisterConst< Rb, 0x7 > MUL9;         /**< 0111: PLL input clock * 9     */
        typedef RegisterConst< Rb, 0xD > MUL6_5;       /**< 1101: PLL input clock * 6.5   */
#else
        typedef RegisterConst< Rb, 0x0 > MUL2;         /**< 0000: PLL input clock*2    */
        typedef RegisterConst< Rb, 0x1 > MUL3;         /**< 0001: PLL input clock*3    */
        typedef RegisterConst< Rb, 0x2 > MUL4;         /**< 0010: PLL input clock*4    */
        typedef RegisterConst< Rb, 0x3 > MUL5;         /**< 0011: PLL input clock*5    */
        typedef RegisterConst< Rb, 0x4 > MUL6;         /**< 0100: PLL input clock*6    */
        typedef RegisterConst< Rb, 0x5 > MUL7;         /**< 0101: PLL input clock*7    */
        typedef RegisterConst< Rb, 0x6 > MUL8;         /**< 0110: PLL input clock*8    */
        typedef RegisterConst< Rb, 0x7 > MUL9;         /**< 0111: PLL input clock*9    */
        typedef RegisterConst< Rb, 0x8 > MUL10;        /**< 1000: PLL input clock10    */
        typedef RegisterConst< Rb, 0x9 > MUL11;        /**< 1001: PLL input clock*11   */
        typedef RegisterConst< Rb, 0xA > MUL12;        /**< 1010: PLL input clock*12   */
        typedef RegisterConst< Rb, 0xB > MUL13;        /**< 1011: PLL input clock*13   */
        typedef RegisterConst< Rb, 0xC > MUL14;        /**< 1100: PLL input clock*14   */
        typedef RegisterConst< Rb, 0xD > MUL15;        /**< 1101: PLL input clock*15   */
        typedef RegisterConst< Rb, 0xE > MUL16;        /**< 1110: PLL input clock*16   */
#endif
      };

#ifdef STM32F10X_CL
      /** USB OTG FS prescaler  */
      template<typename Rb>
      struct __OTGFSPRE
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV3;
        typedef RegisterConst< Rb, 0x1 > DIV2;
      };
#else
      /** USB prescaler  */
      template<typename Rb>
      struct __USBPRE
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV1_5;
        typedef RegisterConst< Rb, 0x1 > DIV1;
      };
#endif

      /** Microcontroller Clock Output  */
      template<typename Rb>
      struct __MCO
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > NOCLOCK;      /**< 00xx: No clock                          */
        typedef RegisterConst< Rb, 0x4 > SYSCLK;       /**< 0100: System clock selected             */
        typedef RegisterConst< Rb, 0x5 > HSI;          /**< 0101: HSI clock selected                */
        typedef RegisterConst< Rb, 0x6 > HSE;          /**< 0110: HSE clock selected                */
        typedef RegisterConst< Rb, 0x7 > PLL_DIV2;     /**< 0111: PLL clock divided by 2 selected   */
#ifdef STM32F10X_CL
        typedef RegisterConst< Rb, 0x8 > PLL2;         /**< 1000: PLL2 clock selected                                              */
        typedef RegisterConst< Rb, 0x9 > PLL3_DIV2;    /**< 1001: PLL3 clock divided by 2 selected                                 */
        typedef RegisterConst< Rb, 0xA > Ext_HSE;      /**< 1010: XT1 external 3-25 MHz oscillator clock selected (for Ethernet)   */
        typedef RegisterConst< Rb, 0xB > PLL3;         /**< 1011: PLL3 clock selected (for Ethernet)                               */
#endif
      };

    public:

      typedef __SWx     < RegisterBits< R,  0,  2 > > SW;       /**< [ 1: 0] System clock Switch                                          */
      typedef __SWx     < RegisterBits< R,  2,  2 > > SWS;      /**< [ 3: 2] System Clock Switch Status                                   */
      typedef __HPRE    < RegisterBits< R,  4,  4 > > HPRE;     /**< [ 7: 4] AHB prescaler                                                */
      typedef __PPREx   < RegisterBits< R,  8,  3 > > PPRE1;    /**< [10: 8] APB low-speed prescaler (APB1)                               */
      typedef __PPREx   < RegisterBits< R, 11,  3 > > PPRE2;    /**< [13:11] APB high-speed prescaler (APB2)                              */
      typedef __ADCPRE  < RegisterBits< R, 14,  2 > > ADCPRE;   /**< [15:14] ADC prescaler                                                */
      typedef __PLLSRC  < RegisterBits< R, 16,  1 > > PLLSRC;   /**< [16:16] PLL entry clock source                                       */
      typedef __PLLXTPRE< RegisterBits< R, 17,  1 > > PLLXTPRE; /**< [17:17] HSE divider for PLL entry / LSB of division factor PREDIV1   */
      typedef __PLLMUL  < RegisterBits< R, 18,  4 > > PLLMUL;   /**< [21:18] PLL multiplication factor                                    */
#ifdef STM32F10X_CL
      typedef __OTGFSPRE< RegisterBits< R, 22,  1 > > OTGFSPRE; /**< [22:22] USB OTG FS prescaler                                         */
      typedef __MCO     < RegisterBits< R, 24,  4 > > MCO; /**< [27:24] Microcontroller Clock Output   */
#else
      typedef __USBPRE  < RegisterBits< R, 22,  1 > > USBPRE;   /**< [22:22] USB prescaler                                                */
      typedef __MCO     < RegisterBits< R, 24,  3 > > MCO; /**< [26:24] Microcontroller Clock Output   */
#endif
    };


    /**
     * Clock interrupt register
     */
    template<typename R>
    struct __CIR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > LSIRDYF;       /**< [ 0: 0] LSI Ready Interrupt flag                */
      typedef RegisterBits< R,  1,  1 > LSERDYF;       /**< [ 1: 1] LSE Ready Interrupt flag                */
      typedef RegisterBits< R,  2,  1 > HSIRDYF;       /**< [ 2: 2] HSI Ready Interrupt flag                */
      typedef RegisterBits< R,  3,  1 > HSERDYF;       /**< [ 3: 3] HSE Ready Interrupt flag                */
      typedef RegisterBits< R,  4,  1 > PLLRDYF;       /**< [ 4: 4] PLL Ready Interrupt flag                */
      typedef RegisterBits< R,  7,  1 > CSSF;          /**< [ 7: 7] Clock Security System Interrupt flag    */
      typedef RegisterBits< R,  8,  1 > LSIRDYIE;      /**< [ 8: 8] LSI Ready Interrupt Enable              */
      typedef RegisterBits< R,  9,  1 > LSERDYIE;      /**< [ 9: 9] LSE Ready Interrupt Enable              */
      typedef RegisterBits< R, 10,  1 > HSIRDYIE;      /**< [10:10] HSI Ready Interrupt Enable              */
      typedef RegisterBits< R, 11,  1 > HSERDYIE;      /**< [11:11] HSE Ready Interrupt Enable              */
      typedef RegisterBits< R, 12,  1 > PLLRDYIE;      /**< [12:12] PLL Ready Interrupt Enable              */
      typedef RegisterBits< R, 16,  1 > LSIRDYC;       /**< [16:16] LSI Ready Interrupt Clear               */
      typedef RegisterBits< R, 17,  1 > LSERDYC;       /**< [17:17] LSE Ready Interrupt Clear               */
      typedef RegisterBits< R, 18,  1 > HSIRDYC;       /**< [18:18] HSI Ready Interrupt Clear               */
      typedef RegisterBits< R, 19,  1 > HSERDYC;       /**< [19:19] HSE Ready Interrupt Clear               */
      typedef RegisterBits< R, 20,  1 > PLLRDYC;       /**< [20:20] PLL Ready Interrupt Clear               */
      typedef RegisterBits< R, 23,  1 > CSSC;          /**< [23:23] Clock Security System Interrupt Clear   */

#ifdef STM32F10X_CL
      typedef RegisterBits< R,  5,  1 > PLL2RDYF;      /**< [ 5: 5] PLL2 Ready Interrupt flag     */
      typedef RegisterBits< R,  6,  1 > PLL3RDYF;      /**< [ 6: 6] PLL3 Ready Interrupt flag     */
      typedef RegisterBits< R, 13,  1 > PLL2RDYIE;     /**< [13:13] PLL2 Ready Interrupt Enable   */
      typedef RegisterBits< R, 14,  1 > PLL3RDYIE;     /**< [14:14] PLL3 Ready Interrupt Enable   */
      typedef RegisterBits< R, 21,  1 > PLL2RDYC;      /**< [21:21] PLL2 Ready Interrupt Clear    */
      typedef RegisterBits< R, 22,  1 > PLL3RDYC;      /**< [22:22] PLL3 Ready Interrupt Clear    */
#endif /* STM32F10X_CL */
    };


    /**
     * APB2 peripheral reset register
     */
    template<typename R>
    struct __APB2RSTR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > AFIORST;       /**< [ 0: 0] Alternate Function I/O reset   */
      typedef RegisterBits< R,  2,  1 > IOPARST;       /**< [ 2: 2] I/O port A reset               */
      typedef RegisterBits< R,  3,  1 > IOPBRST;       /**< [ 3: 3] I/O port B reset               */
      typedef RegisterBits< R,  4,  1 > IOPCRST;       /**< [ 4: 4] I/O port C reset               */
      typedef RegisterBits< R,  5,  1 > IOPDRST;       /**< [ 5: 5] I/O port D reset               */
      typedef RegisterBits< R,  9,  1 > ADC1RST;       /**< [ 9: 9] ADC 1 interface reset          */

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL)
      typedef RegisterBits< R, 10,  1 > ADC2RST;       /**< [10:10] ADC 2 interface reset   */
#endif

      typedef RegisterBits< R, 11,  1 > TIM1RST;       /**< [11:11] TIM1 Timer reset   */
      typedef RegisterBits< R, 12,  1 > SPI1RST;       /**< [12:12] SPI 1 reset        */
      typedef RegisterBits< R, 14,  1 > USART1RST;     /**< [14:14] USART1 reset       */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL)
      typedef RegisterBits< R, 16,  1 > TIM15RST;      /**< [16:16] TIM15 Timer reset   */
      typedef RegisterBits< R, 17,  1 > TIM16RST;      /**< [17:17] TIM16 Timer reset   */
      typedef RegisterBits< R, 18,  1 > TIM17RST;      /**< [18:18] TIM17 Timer reset   */
#endif

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
      typedef RegisterBits< R,  6,  1 > IOPERST;       /**< [ 6: 6] I/O port E reset   */
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
      typedef RegisterBits< R,  7,  1 > IOPFRST;       /**< [ 7: 7] I/O port F reset       */
      typedef RegisterBits< R,  8,  1 > IOPGRST;       /**< [ 8: 8] I/O port G reset       */
      typedef RegisterBits< R, 13,  1 > TIM8RST;       /**< [13:13] TIM8 Timer reset       */
      typedef RegisterBits< R, 15,  1 > ADC3RST;       /**< [15:15] ADC3 interface reset   */
#endif

