digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
#ifdef STM32F10X_XL
      typedef RegisterBits< R, 19,  1 > TIM9RST;       /**< [19:19] TIM9 Timer reset    */
      typedef RegisterBits< R, 20,  1 > TIM10RST;      /**< [20:20] TIM10 Timer reset   */
      typedef RegisterBits< R, 21,  1 > TIM11RST;      /**< [21:21] TIM11 Timer reset   */
#endif /* STM32F10X_XL */
    };


    /**
     * APB1 peripheral reset register
     */
    template<typename R>
    struct __APB1RSTR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > TIM2RST;       /**< [ 0: 0] Timer 2 reset           */
      typedef RegisterBits< R,  1,  1 > TIM3RST;       /**< [ 1: 1] Timer 3 reset           */
      typedef RegisterBits< R, 11,  1 > WWDGRST;       /**< [11:11] Window Watchdog reset   */
      typedef RegisterBits< R, 17,  1 > USART2RST;     /**< [17:17] USART 2 reset           */
      typedef RegisterBits< R, 21,  1 > I2C1RST;       /**< [21:21] I2C 1 reset             */

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL)
      typedef RegisterBits< R, 25,  1 > CAN1RST;       /**< [25:25] CAN1 reset   */
#endif

      typedef RegisterBits< R, 27,  1 > BKPRST;        /**< [27:27] Backup interface reset   */
      typedef RegisterBits< R, 28,  1 > PWRRST;        /**< [28:28] Power interface reset    */

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
      typedef RegisterBits< R,  2,  1 > TIM4RST;       /**< [ 2: 2] Timer 4 reset    */
      typedef RegisterBits< R, 14,  1 > SPI2RST;       /**< [14:14] SPI 2 reset      */
      typedef RegisterBits< R, 18,  1 > USART3RST;     /**< [18:18] RUSART 3 reset   */
      typedef RegisterBits< R, 22,  1 > I2C2RST;       /**< [22:22] I2C 2 reset      */
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_MD) || defined (STM32F10X_LD) || defined  (STM32F10X_XL)
      typedef RegisterBits< R, 23,  1 > USBRST;        /**< [23:23] USB Device reset   */
#endif

#if defined (STM32F10X_HD) || defined  (STM32F10X_CL) || defined  (STM32F10X_XL)
      typedef RegisterBits< R,  3,  1 > TIM5RST;       /**< [ 3: 3] Timer 5 reset         */
      typedef RegisterBits< R,  4,  1 > TIM6RST;       /**< [ 4: 4] Timer 6 reset         */
      typedef RegisterBits< R,  5,  1 > TIM7RST;       /**< [ 5: 5] Timer 7 reset         */
      typedef RegisterBits< R, 15,  1 > SPI3RST;       /**< [15:15] SPI 3 reset           */
      typedef RegisterBits< R, 19,  1 > UART4RST;      /**< [19:19] UART 4 reset          */
      typedef RegisterBits< R, 20,  1 > UART5RST;      /**< [20:20] UART 5 reset          */
      typedef RegisterBits< R, 29,  1 > DACRST;        /**< [29:29] DAC interface reset   */
#endif

#if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL)
      typedef RegisterBits< R,  4,  1 > TIM6RST;       /**< [ 4: 4] Timer 6 reset         */
      typedef RegisterBits< R,  5,  1 > TIM7RST;       /**< [ 5: 5] Timer 7 reset         */
      typedef RegisterBits< R, 29,  1 > DACRST;        /**< [29:29] DAC interface reset   */
      typedef RegisterBits< R, 30,  1 > CECRST;        /**< [30:30] CEC interface reset   */
#endif

#ifdef STM32F10X_CL
      typedef RegisterBits< R, 26,  1 > CAN2RST;       /**< [26:26] CAN2 reset   */
#endif /* STM32F10X_CL */

#ifdef STM32F10X_XL
      typedef RegisterBits< R,  6,  1 > TIM12RST;      /**< [ 6: 6] TIM12 Timer reset   */
      typedef RegisterBits< R,  7,  1 > TIM13RST;      /**< [ 7: 7] TIM13 Timer reset   */
      typedef RegisterBits< R,  8,  1 > TIM14RST;      /**< [ 8: 8] TIM14 Timer reset   */
#endif /* STM32F10X_XL */
    };


    /**
     * AHB peripheral clock enable register
     */
    template<typename R>
    struct __AHBENR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > DMA1EN;        /**< [ 0: 0] DMA1 clock enable             */
      typedef RegisterBits< R,  2,  1 > SRAMEN;        /**< [ 2: 2] SRAM interface clock enable   */
      typedef RegisterBits< R,  4,  1 > FLITFEN;       /**< [ 4: 4] FLITF clock enable            */
      typedef RegisterBits< R,  6,  1 > CRCEN;         /**< [ 6: 6] CRC clock enable              */

#if defined (STM32F10X_HD) || defined  (STM32F10X_CL)
      typedef RegisterBits< R,  1,  1 > DMA2EN;        /**< [ 1: 1] DMA2 clock enable   */
#endif

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
      typedef RegisterBits< R,  8,  1 > FSMCEN;        /**< [ 8: 8] FSMC clock enable   */
      typedef RegisterBits< R, 10,  1 > SDIOEN;        /**< [10:10] SDIO clock enable   */
#endif

#ifdef STM32F10X_CL
      typedef RegisterBits< R, 12,  1 > OTGFSEN;       /**< [12:12] USB OTG FS clock enable        */
      typedef RegisterBits< R, 14,  1 > ETHMACEN;      /**< [14:14] ETHERNET MAC clock enable      */
      typedef RegisterBits< R, 15,  1 > ETHMACTXEN;    /**< [15:15] ETHERNET MAC Tx clock enable   */
      typedef RegisterBits< R, 16,  1 > ETHMACRXEN;    /**< [16:16] ETHERNET MAC Rx clock enable   */
#endif /* STM32F10X_CL */
    };


    /**
     * APB2 peripheral clock enable register
     */
    template<typename R>
    struct __APB2ENR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > AFIOEN;        /**< [ 0: 0] Alternate Function I/O clock enable   */
      typedef RegisterBits< R,  2,  1 > IOPAEN;        /**< [ 2: 2] I/O port A clock enable               */
      typedef RegisterBits< R,  3,  1 > IOPBEN;        /**< [ 3: 3] I/O port B clock enable               */
      typedef RegisterBits< R,  4,  1 > IOPCEN;        /**< [ 4: 4] I/O port C clock enable               */
      typedef RegisterBits< R,  5,  1 > IOPDEN;        /**< [ 5: 5] I/O port D clock enable               */
      typedef RegisterBits< R,  9,  1 > ADC1EN;        /**< [ 9: 9] ADC 1 interface clock enable          */

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL)
      typedef RegisterBits< R, 10,  1 > ADC2EN;        /**< [10:10] ADC 2 interface clock enable   */
#endif

      typedef RegisterBits< R, 11,  1 > TIM1EN;        /**< [11:11] TIM1 Timer clock enable   */
      typedef RegisterBits< R, 12,  1 > SPI1EN;        /**< [12:12] SPI 1 clock enable        */
      typedef RegisterBits< R, 14,  1 > USART1EN;      /**< [14:14] USART1 clock enable       */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL)
      typedef RegisterBits< R, 16,  1 > TIM15EN;       /**< [16:16] TIM15 Timer clock enable   */
      typedef RegisterBits< R, 17,  1 > TIM16EN;       /**< [17:17] TIM16 Timer clock enable   */
      typedef RegisterBits< R, 18,  1 > TIM17EN;       /**< [18:18] TIM17 Timer clock enable   */
#endif

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
      typedef RegisterBits< R,  6,  1 > IOPEEN;        /**< [ 6: 6] I/O port E clock enable   */
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
      typedef RegisterBits< R,  7,  1 > IOPFEN;        /**< [ 7: 7] I/O port F clock enable   */
      typedef RegisterBits< R,  8,  1 > IOPGEN;        /**< [ 8: 8] I/O port G clock enable   */
      typedef RegisterBits< R, 13,  1 > TIM8EN;        /**< [13:13] TIM8 Timer clock enable   */
      typedef RegisterBits< R, 15,  1 > ADC3EN;        /**< [15:15] DMA1 clock enable         */
#endif

