digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
#ifdef STM32F10X_XL
      typedef RegisterBits< R, 19,  1 > TIM9EN;        /**< [19:19] TIM9 Timer clock enable    */
      typedef RegisterBits< R, 20,  1 > TIM10EN;       /**< [20:20] TIM10 Timer clock enable   */
      typedef RegisterBits< R, 21,  1 > TIM11EN;       /**< [21:21] TIM11 Timer clock enable   */
#endif
    };


    /**
     * APB1 peripheral clock enable register
     */
    template<typename R>
    struct __APB1ENR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > TIM2EN;        /**< [ 0: 0] Timer 2 clock enabled          */
      typedef RegisterBits< R,  1,  1 > TIM3EN;        /**< [ 1: 1] Timer 3 clock enable           */
      typedef RegisterBits< R, 11,  1 > WWDGEN;        /**< [11:11] Window Watchdog clock enable   */
      typedef RegisterBits< R, 17,  1 > USART2EN;      /**< [17:17] USART 2 clock enable           */
      typedef RegisterBits< R, 21,  1 > I2C1EN;        /**< [21:21] I2C 1 clock enable             */

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL)
      typedef RegisterBits< R, 25,  1 > CAN1EN;        /**< [25:25] CAN1 clock enable   */
#endif

      typedef RegisterBits< R, 27,  1 > BKPEN;         /**< [27:27] Backup interface clock enable   */
      typedef RegisterBits< R, 28,  1 > PWREN;         /**< [28:28] Power interface clock enable    */

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
      typedef RegisterBits< R,  2,  1 > TIM4EN;        /**< [ 2: 2] Timer 4 clock enable   */
      typedef RegisterBits< R, 14,  1 > SPI2EN;        /**< [14:14] SPI 2 clock enable     */
      typedef RegisterBits< R, 18,  1 > USART3EN;      /**< [18:18] USART 3 clock enable   */
      typedef RegisterBits< R, 22,  1 > I2C2EN;        /**< [22:22] I2C 2 clock enable     */
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_MD) || defined  (STM32F10X_LD)
      typedef RegisterBits< R, 23,  1 > USBEN;         /**< [23:23] USB Device clock enable   */
#endif

#if defined (STM32F10X_HD) || defined  (STM32F10X_CL)
      typedef RegisterBits< R,  3,  1 > TIM5EN;        /**< [ 3: 3] Timer 5 clock enable         */
      typedef RegisterBits< R,  4,  1 > TIM6EN;        /**< [ 4: 4] Timer 6 clock enable         */
      typedef RegisterBits< R,  5,  1 > TIM7EN;        /**< [ 5: 5] Timer 7 clock enable         */
      typedef RegisterBits< R, 15,  1 > SPI3EN;        /**< [15:15] SPI 3 clock enable           */
      typedef RegisterBits< R, 19,  1 > UART4EN;       /**< [19:19] UART 4 clock enable          */
      typedef RegisterBits< R, 20,  1 > UART5EN;       /**< [20:20] UART 5 clock enable          */
      typedef RegisterBits< R, 29,  1 > DACEN;         /**< [29:29] DAC interface clock enable   */
#endif

#if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL)
      typedef RegisterBits< R,  4,  1 > TIM6EN;        /**< [ 4: 4] Timer 6 clock enable         */
      typedef RegisterBits< R,  5,  1 > TIM7EN;        /**< [ 5: 5] Timer 7 clock enable         */
      typedef RegisterBits< R, 29,  1 > DACEN;         /**< [29:29] DAC interface clock enable   */
      typedef RegisterBits< R, 30,  1 > CECEN;         /**< [30:30] CEC interface clock enable   */
#endif

#ifdef STM32F10X_CL
      typedef RegisterBits< R, 26,  1 > CAN2EN;        /**< [26:26] CAN2 clock enable   */
#endif /* STM32F10X_CL */

#ifdef STM32F10X_XL
      typedef RegisterBits< R,  6,  1 > TIM12EN;       /**< [ 6: 6] TIM12 Timer clock enable   */
      typedef RegisterBits< R,  7,  1 > TIM13EN;       /**< [ 7: 7] TIM13 Timer clock enable   */
      typedef RegisterBits< R,  8,  1 > TIM14EN;       /**< [ 8: 8] TIM14 Timer clock enable   */
#endif /* STM32F10X_XL */
    };


    /**
     * Backup domain control register
     */
    template<typename R>
    class __BDCR
    : public R
    {
      /** RTC clock source selection  */
      template<typename Rb>
      struct __RTCSEL
      : public Rb
      {
        typedef RegisterConst< Rb, 0x1 > LSE;          /**< 01: LSE oscillator clock used as RTC clock                  */
        typedef RegisterConst< Rb, 0x2 > LSI;          /**< 10: LSI oscillator clock used as RTC clock                  */
        typedef RegisterConst< Rb, 0x3 > HSE;          /**< 11: HSE oscillator clock divided by 128 used as RTC clock   */
      };

    public:

      typedef            RegisterBits< R,  0,  1 >   LSEON;  /**< [ 0: 0] External Low Speed oscillator enable   */
      typedef            RegisterBits< R,  1,  1 >   LSERDY; /**< [ 1: 1] External Low Speed oscillator Ready    */
      typedef            RegisterBits< R,  2,  1 >   LSEBYP; /**< [ 2: 2] External Low Speed oscillator Bypass   */
      typedef __RTCSEL < RegisterBits< R,  8,  2 > > RTCSEL; /**< [ 9: 8] RTC clock source selection             */
      typedef            RegisterBits< R, 15,  1 >   RTCEN;  /**< [15:15] RTC clock enable                       */
      typedef            RegisterBits< R, 16,  1 >   BDRST;  /**< [16:16] Backup domain software reset           */
    };


    /**
     * Control/status register
     */
    template<typename R>
    struct __CSR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > LSION;         /**< [ 0: 0] Internal Low Speed oscillator enable   */
      typedef RegisterBits< R,  1,  1 > LSIRDY;        /**< [ 1: 1] Internal Low Speed oscillator Ready    */
      typedef RegisterBits< R, 24,  1 > RMVF;          /**< [24:24] Remove reset flag                      */
      typedef RegisterBits< R, 26,  1 > PINRSTF;       /**< [26:26] PIN reset flag                         */
      typedef RegisterBits< R, 27,  1 > PORRSTF;       /**< [27:27] POR/PDR reset flag                     */
      typedef RegisterBits< R, 28,  1 > SFTRSTF;       /**< [28:28] Software Reset flag                    */
      typedef RegisterBits< R, 29,  1 > IWDGRSTF;      /**< [29:29] Independent Watchdog reset flag        */
      typedef RegisterBits< R, 30,  1 > WWDGRSTF;      /**< [30:30] Window watchdog reset flag             */
      typedef RegisterBits< R, 31,  1 > LPWRRSTF;      /**< [31:31] Low-Power reset flag                   */
    };


    /**
     * AHB peripheral clock reset register
     *
     * NOTE: only available for Connectivity line (CL) devices
     */
    template<typename R>
    struct __AHBRSTR
    : public R
    {
#ifdef STM32F10X_CL
      typedef RegisterBits< R, 12,  1 > OTGFSRST;      /**< [12:12] USB OTG FS reset     */
      typedef RegisterBits< R, 14,  1 > ETHMACRST;     /**< [14:14] ETHERNET MAC reset   */
#endif /* STM32F10X_CL */
    };


    /**
     * Clock configuration register2
     */
    template<typename R>
    class __CFGR2
    : public R
    {

