digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
      /** PREDIVx division factor  */
      template<typename Rb>
      struct __PREDIVx
      : public Rb
      {
        template<unsigned divisor>
        struct DIV
        : public RegisterConst< Rb, divisor - 1 >
        { static_assert((divisor >= 1) && (divisor <= 16), "invalid divisor"); };
      };

      /** PLLx Multiplication Factor */
      template<typename Rb>
      struct __PLLxMUL
      : public Rb
      {
        template<unsigned factor>
        struct MUL
        : public RegisterConst< Rb, factor <= 14 ? factor - 2 :
                                    factor == 16 ? 0xE :
                                    factor == 20 ? 0xF : 0 >
        { static_assert(((factor >= 1) && (factor <= 14)) || (factor == 16) || (factor == 20), "invalid factor"); };
      };

      /** PREDIV1 entry clock source  */
      template<typename Rb>
      struct __PREDIV1SRC
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > HSE;          /**< 0: HSE oscillator clock selected as PREDIV1 clock entry   */
        typedef RegisterConst< Rb, 0x1 > PLL2;         /**< 1: PLL2 selected as PREDIV1 clock entry                   */
      };

      /** I2Sx clock source  */
      template<typename Rb>
      struct __I2SxSRC
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > SYSCLK;       /**< 0: System clock (SYSCLK) selected as I2Sx clock entry   */
        typedef RegisterConst< Rb, 0x1 > PLL3;         /**< 1: PLL3 VCO clock selected as I2Sx clock entry          */
      };

    public:

      typedef __PREDIVx    < RegisterBits< R,  0,  4 > > PREDIV1;    /**< [ 3: 0] PREDIV1 division factor      */
      typedef __PREDIVx    < RegisterBits< R,  4,  4 > > PREDIV2;    /**< [ 7: 4] PREDIV2 division factor      */
      typedef __PLLxMUL    < RegisterBits< R,  8,  4 > > PLL2MUL;    /**< [11: 8] PLL2 Multiplication Factor   */
      typedef __PLLxMUL    < RegisterBits< R, 12,  4 > > PLL3MUL;    /**< [15:12] PLL3 Multiplication Factor   */
      typedef __PREDIV1SRC < RegisterBits< R, 16,  1 > > PREDIV1SRC; /**< [16:16] PREDIV1 entry clock source   */
      typedef __I2SxSRC    < RegisterBits< R, 17,  1 > > I2S2SRC;    /**< [17:17] I2S2 clock source            */
      typedef __I2SxSRC    < RegisterBits< R, 18,  1 > > I2S3SRC;    /**< [18:18] I2S3 clock source            */
    };

  public:

    typedef __CR      < Register< uint32_t, reg_base + 0x00, access::rw, 0x00000083 /*TODO: 0x0000xx83*/ > > CR;
    typedef __CFGR    < Register< uint32_t, reg_base + 0x04, access::rw > > CFGR;
    typedef __CIR     < Register< uint32_t, reg_base + 0x08, access::rw > > CIR;
    typedef __APB2RSTR< Register< uint32_t, reg_base + 0x0c, access::rw > > APB2RSTR;
    typedef __APB1RSTR< Register< uint32_t, reg_base + 0x10, access::rw > > APB1RSTR;
    typedef __AHBENR  < Register< uint32_t, reg_base + 0x14, access::rw > > AHBENR;
    typedef __APB2ENR < Register< uint32_t, reg_base + 0x18, access::rw > > APB2ENR;
    typedef __APB1ENR < Register< uint32_t, reg_base + 0x1c, access::rw > > APB1ENR;
    typedef __BDCR    < Register< uint32_t, reg_base + 0x20, access::rw > > BDCR;
    typedef __CSR     < Register< uint32_t, reg_base + 0x24, access::rw, 0x0C000000 > > CSR;
#ifdef STM32F10X_CL
    typedef __AHBRSTR < Register< uint32_t, reg_base + 0x28, access::rw > > AHBRSTR;
    typedef __CFGR2   < Register< uint32_t, reg_base + 0x2c, access::rw > > CFGR2;
#endif
  };


  /**
   * Power control registers (PWR)
   */
  class PWR
  {
    static constexpr reg_addr_t reg_base = APB1_BASE + 0x7000;

    /**
     * Power control register
     */
    template<typename R>
    class __CR
    : public R
    {
      /** PVD Level Selection  */
      template<typename Rb>
      struct __PLS
      : public Rb
      {
        /** PVD Threshold of 2.<fraction> volts (e.g. 2.5V if fraction=5) */
        template<unsigned int fraction>
        struct VoltageThreshold
        : public RegisterConst< Rb, fraction - 2 >
        { static_assert((fraction >= 2) && (fraction <= 9), "invalid fraction"); };
      };

    public:

      typedef         RegisterBits< R,  0,  1 >   LPDS; /**< [ 0: 0] Low-Power Deepsleep                      */
      typedef         RegisterBits< R,  1,  1 >   PDDS; /**< [ 1: 1] Power Down Deepsleep                     */
      typedef         RegisterBits< R,  2,  1 >   CWUF; /**< [ 2: 2] Clear Wakeup Flag                        */
      typedef         RegisterBits< R,  3,  1 >   CSBF; /**< [ 3: 3] Clear Standby Flag                       */
      typedef         RegisterBits< R,  4,  1 >   PVDE; /**< [ 4: 4] Power Voltage Detector Enable            */
      typedef __PLS < RegisterBits< R,  5,  3 > > PLS;  /**< [ 7: 5] PVD Level Selection                      */
      typedef         RegisterBits< R,  8,  1 >   DBP;  /**< [ 8: 8] Disable Backup Domain write protection   */
    };


    /**
     * Power control/status register
     */
    template<typename R>
    struct __CSR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > WUF;           /**< [ 0: 0] Wakeup Flag       */
      typedef RegisterBits< R,  1,  1 > SBF;           /**< [ 1: 1] Standby Flag      */
      typedef RegisterBits< R,  2,  1 > PVDO;          /**< [ 2: 2] PVD Output        */
      typedef RegisterBits< R,  8,  1 > EWUP;          /**< [ 8: 8] Enable WKUP pin   */
    };

  public:

    typedef __CR < Register< uint32_t, reg_base + 0x00, access::rw > > CR;
    typedef __CSR< Register< uint32_t, reg_base + 0x04, access::rw > > CSR;
  };


  /**
   * Embedded Flash memory (FLASH)
   */
  class FLASH
  {
    static constexpr reg_addr_t reg_base = AHB_BASE + 0x2000;

    /**
     * Flash access control register
     */
    template<typename R>
    struct __ACR
    : public R
    {
      typedef RegisterBits< R,  0,  2 > LATENCY;       /**< [ 1: 0] Latency                          */
      typedef RegisterBits< R,  3,  1 > HLFCYA;        /**< [ 3: 3] Flash Half Cycle Access Enable   */
      typedef RegisterBits< R,  4,  1 > PRFTBE;        /**< [ 4: 4] Prefetch Buffer Enable           */
      typedef RegisterBits< R,  5,  1 > PRFTBS;        /**< [ 5: 5] Prefetch Buffer Status           */
    };

    /**
     * FPEC Key
     */
    template<typename R>
    struct __KEYR
    : public R
    {
    };

    /**
     * Option Byte Key
     */
    template<typename R>
    struct __OPTKEYR
    : public R
    {
    };

    /**
     * document me!
     */
    template<typename R>
    struct __SR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > BSY;           /**< [ 0: 0] Busy                     */
      typedef RegisterBits< R,  2,  1 > PGERR;         /**< [ 2: 2] Programming Error        */
      typedef RegisterBits< R,  4,  1 > WRPRTERR;      /**< [ 4: 4] Write Protection Error   */
      typedef RegisterBits< R,  5,  1 > EOP;           /**< [ 5: 5] End of operation         */
    };


    /**
     * document me!
     */
    template<typename R>
    struct __CR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > PG;            /**< [ 0: 0] Programming                         */
      typedef RegisterBits< R,  1,  1 > PER;           /**< [ 1: 1] Page Erase                          */
      typedef RegisterBits< R,  2,  1 > MER;           /**< [ 2: 2] Mass Erase                          */
      typedef RegisterBits< R,  4,  1 > OPTPG;         /**< [ 4: 4] Option Byte Programming             */
      typedef RegisterBits< R,  5,  1 > OPTER;         /**< [ 5: 5] Option Byte Erase                   */
      typedef RegisterBits< R,  6,  1 > STRT;          /**< [ 6: 6] Start                               */
      typedef RegisterBits< R,  7,  1 > LOCK;          /**< [ 7: 7] Lock                                */
      typedef RegisterBits< R,  9,  1 > OPTWRE;        /**< [ 9: 9] Option Bytes Write Enable           */
      typedef RegisterBits< R, 10,  1 > ERRIE;         /**< [10:10] Error Interrupt Enable              */
      typedef RegisterBits< R, 12,  1 > EOPIE;         /**< [12:12] End of operation interrupt enable   */
    };

    /**
     * Flash Address
     */
    template<typename R>
    struct __AR
    : public R
    {
    };


    /* reserved: 0x4002 2018 - 0x4002 201B */


    /**
     * Option Byte Register
     */
    template<typename R>
    struct __OBR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > OPTERR;        /**< [ 0: 0] Option Byte Error   */
      typedef RegisterBits< R,  1,  1 > RDPRT;         /**< [ 1: 1] Read protection     */
      typedef RegisterBits< R,  2,  8 > USER;          /**< [ 9: 2] User Option Bytes   */
      typedef RegisterBits< R,  2,  1 > WDG_SW;        /**< [ 2: 2] WDG_SW              */
      typedef RegisterBits< R,  3,  1 > nRST_STOP;     /**< [ 3: 3] nRST_STOP           */
      typedef RegisterBits< R,  4,  1 > nRST_STDBY;    /**< [ 4: 4] nRST_STDBY          */
      typedef RegisterBits< R,  5,  1 > BFB2;          /**< [ 5: 5] BFB2                */
    };

    /**
     * Write Protect
     */
    template<typename R>
    struct __WRPR
    : public R
    {
    };


    /* reserved: 0x4002 2024 - 0x4002 2043 */


    /**
     * document me!
     *
     * NOTE: only available for XL-density Flash modules
     */
    template<typename R>
    struct __KEYR2
    : public R
    {
    };


    /* reserved: 0x4002 2048 - 0x4002 204B */


    /**
     * document me!
     *
     * NOTE: only available for XL-density Flash modules
     */
    template<typename R>
    struct __SR2
    : public R
    {
    };

    /**
     * document me!
     *
     * NOTE: only available for XL-density Flash modules
     */
    template<typename R>
    struct __CR2
    : public R
    {
    };

    /**
     * document me!
     *
     * NOTE: only available for XL-density Flash modules
     */
    template<typename R>
    struct __AR2
    : public R
    {
    };


