digint/openmptl/arch/stm32f10x/include/arch/register_defs.hpp
  public:

    typedef __ACR    < Register< uint32_t, reg_base + 0x00, access::rw, 0x00000030 > > ACR;
    typedef __KEYR   < Register< uint32_t, reg_base + 0x04, access::rw > > KEYR;
    typedef __OPTKEYR< Register< uint32_t, reg_base + 0x08, access::rw > > OPTKEYR;
    typedef __SR     < Register< uint32_t, reg_base + 0x0c, access::rw > > SR;
    typedef __CR     < Register< uint32_t, reg_base + 0x10, access::rw > > CR;
    typedef __AR     < Register< uint32_t, reg_base + 0x14, access::rw > > AR;
    typedef __OBR    < Register< uint32_t, reg_base + 0x1c, access::rw > > OBR;
    typedef __WRPR   < Register< uint32_t, reg_base + 0x20, access::rw > > WRPR;
    typedef __KEYR2  < Register< uint32_t, reg_base + 0x44, access::rw > > KEYR2;
    typedef __SR2    < Register< uint32_t, reg_base + 0x4c, access::rw > > SR2;
    typedef __CR2    < Register< uint32_t, reg_base + 0x50, access::rw > > CR2;
    typedef __AR2    < Register< uint32_t, reg_base + 0x54, access::rw > > AR2;
  };


  /**
   * Real-time clock (RTC)
   *
   * Note that the registers are actually only 16bit wide, but accessing
   * them with 32bit is faster in general.
   */
  class RTC
  {
    static constexpr reg_addr_t reg_base = APB1_BASE + 0x2800;

    /**
     * RTC control register high
     */
    template<typename R>
    struct __CRH
    : public R
    {
      typedef RegisterBits< R,  0,  1 > SECIE;         /**< [ 0: 0] Second Interrupt Enable     */
      typedef RegisterBits< R,  1,  1 > ALRIE;         /**< [ 1: 1] Alarm Interrupt Enable      */
      typedef RegisterBits< R,  2,  1 > OWIE;          /**< [ 2: 2] OverfloW Interrupt Enable   */
    };


    /**
     * RTC control register low
     */
    template<typename R>
    struct __CRL
    : public R
    {
      typedef RegisterBits< R,  0,  1 > SECF;          /**< [ 0: 0] Second Flag                   */
      typedef RegisterBits< R,  1,  1 > ALRF;          /**< [ 1: 1] Alarm Flag                    */
      typedef RegisterBits< R,  2,  1 > OWF;           /**< [ 2: 2] OverfloW Flag                 */
      typedef RegisterBits< R,  3,  1 > RSF;           /**< [ 3: 3] Registers Synchronized Flag   */
      typedef RegisterBits< R,  4,  1 > CNF;           /**< [ 4: 4] Configuration Flag            */
      typedef RegisterBits< R,  5,  1 > RTOFF;         /**< [ 5: 5] RTC operation OFF             */
    };

    /**
     * RTC prescaler load register high
     */
    template<typename R>
    struct __PRLH
    : public R
    {
      typedef RegisterBits< R,  0,  4 > PRL;           /**< [ 3: 0] RTC Prescaler Reload Value High   */
    };

    /**
     * RTC prescaler load register low
     */
    template<typename R>
    struct __PRLL
    : public R
    {
      typedef RegisterBits< R,  0, 16 > PRL;           /**< [15: 0] RTC Prescaler Reload Value Low   */
    };

    /**
     * RTC prescaler divider register high
     */
    template<typename R>
    struct __DIVH
    : public R
    {
      typedef RegisterBits< R,  0,  4 > RTC_DIV;       /**< [ 3: 0] RTC Clock Divider High   */
    };

    /**
     * RTC prescaler divider register low
     */
    template<typename R>
    struct __DIVL
    : public R
    {
      typedef RegisterBits< R,  0, 16 > RTC_DIV;       /**< [15: 0] RTC Clock Divider Low   */
    };

    /**
     * RTC counter register high
     */
    template<typename R>
    struct __CNTH
    : public R
    {
      typedef RegisterBits< R,  0, 16 > RTC_CNT;       /**< [15: 0] RTC Counter High   */
    };

    /**
     * RTC counter register low
     */
    template<typename R>
    struct __CNTL
    : public R
    {
      typedef RegisterBits< R,  0, 16 > RTC_CNT;       /**< [15: 0] RTC Counter Low   */
    };

    /**
     * RTC alarm register high
     */
    template<typename R>
    struct __ALRH
    : public R
    {
      typedef RegisterBits< R,  0, 16 > RTC_ALR;       /**< [15: 0] RTC Alarm High   */
    };

    /**
     * RTC alarm register low
     */
    template<typename R>
    struct __ALRL
    : public R
    {
      typedef RegisterBits< R,  0, 16 > RTC_ALR;       /**< [15: 0] RTC Alarm Low   */
    };


  public:

    // TODO: use "uint_fast16_t", this is way cooler!
    typedef __CRH < Register< uint32_t, reg_base + 0x00, access::rw         > > CRH;  /**< RTC control register high             */
    typedef __CRL < Register< uint32_t, reg_base + 0x04, access::rw, 0x0020 > > CRL;  /**< RTC control register low              */
    typedef __PRLH< Register< uint32_t, reg_base + 0x08, access::wo         > > PRLH; /**< RTC prescaler load register high      */
    typedef __PRLL< Register< uint32_t, reg_base + 0x0c, access::wo, 0x8000 > > PRLL; /**< RTC prescaler load register low       */
    typedef __DIVH< Register< uint32_t, reg_base + 0x10, access::ro         > > DIVH; /**< RTC prescaler divider register high   */
    typedef __DIVL< Register< uint32_t, reg_base + 0x14, access::ro, 0x8000 > > DIVL; /**< RTC prescaler divider register low    */
    typedef __CNTH< Register< uint32_t, reg_base + 0x18, access::rw         > > CNTH; /**< RTC counter register high             */
    typedef __CNTL< Register< uint32_t, reg_base + 0x1c, access::rw         > > CNTL; /**< RTC counter register low              */
    typedef __ALRH< Register< uint32_t, reg_base + 0x20, access::wo         > > ALRH; /**< RTC alarm register high               */
    typedef __ALRL< Register< uint32_t, reg_base + 0x24, access::wo         > > ALRL; /**< RTC alarm register low                */
  };


  /**
   * General-purpose and alternate-function I/Os (GPIOs and AFIOs)
   */
  template<char reg_name>
  struct GPIO
  {
    static_assert((reg_name >= 'A') && (reg_name <= 'G'), "invalid index for register");

    static constexpr std::size_t gpio_no   = reg_name - 'A';
    static constexpr reg_addr_t  reg_base = APB2_BASE + 0x0800 + gpio_no * 0x0400;
    
    typedef Register< uint32_t, reg_base + 0x00, access::rw, 0x44444444 > CRL;            /**< Port configuration register low    */
    typedef Register< uint32_t, reg_base + 0x04, access::rw, 0x44444444 > CRH;            /**< Port configuration register high   */
    typedef Register< uint32_t, reg_base + 0x08, access::ro /* TODO: 0x0000XXXX */ > IDR; /**< Port input data register           */
    typedef Register< uint32_t, reg_base + 0x0c, access::rw             > ODR;            /**< Port output data register          */
    typedef Register< uint32_t, reg_base + 0x10, access::wo             > BSRR;           /**< Port bit set/reset register        */
    typedef Register< uint32_t, reg_base + 0x14, access::wo             > BRR;            /**< Port bit reset register            */
    typedef Register< uint32_t, reg_base + 0x18, access::rw             > LCKR;           /**< Port configuration lock register   */
  };


  /**
   * Analog-to-digital converter (ADC)
   */
  template<std::size_t adc_no>
  class ADC
  {
    static_assert((adc_no >= 1) && (adc_no <= 3), "invalid index for register");

    static constexpr reg_addr_t reg_base = adc_no == 1 ? APB2_BASE + 0x2400 :
                                           adc_no == 2 ? APB2_BASE + 0x2800 :
                                           adc_no == 3 ? APB2_BASE + 0x3C00 :
                                           0;

    /**
     * ADC status register
     */
    template<typename R>
    struct __SR
    : public R
    {
      // TODO: special access rc_w0
      typedef RegisterBits< R,  0,  1 > AWD;           /**< [ 0: 0] Analog watchdog flag                 */
      typedef RegisterBits< R,  1,  1 > EOC;           /**< [ 1: 1] End of conversion                    */
      typedef RegisterBits< R,  2,  1 > JEOC;          /**< [ 2: 2] Injected channel end of conversion   */
      typedef RegisterBits< R,  3,  1 > JSTRT;         /**< [ 3: 3] Injected channel Start flag          */
      typedef RegisterBits< R,  4,  1 > STRT;          /**< [ 4: 4] Regular channel Start flag           */
    };


    /**
     * ADC control register 1
     */
    template<typename R>
    struct __CR1
    : public R
    {
      typedef RegisterBits< R,  0,  5 > AWDCH;         /**< [ 4: 0] Analog watchdog channel select bits                    */
      typedef RegisterBits< R,  5,  1 > EOCIE;         /**< [ 5: 5] Interrupt enable for EOC                               */
      typedef RegisterBits< R,  6,  1 > AWDIE;         /**< [ 6: 6] AAnalog Watchdog interrupt enable                      */
      typedef RegisterBits< R,  7,  1 > JEOCIE;        /**< [ 7: 7] Interrupt enable for injected channels                 */
      typedef RegisterBits< R,  8,  1 > SCAN;          /**< [ 8: 8] Scan mode                                              */
      typedef RegisterBits< R,  9,  1 > AWDSGL;        /**< [ 9: 9] Enable the watchdog on a single channel in scan mode   */
      typedef RegisterBits< R, 10,  1 > JAUTO;         /**< [10:10] Automatic injected group conversion                    */
      typedef RegisterBits< R, 11,  1 > DISCEN;        /**< [11:11] Discontinuous mode on regular channels                 */
      typedef RegisterBits< R, 12,  1 > JDISCEN;       /**< [12:12] Discontinuous mode on injected channels                */
      typedef RegisterBits< R, 13,  3 > DISCNUM;       /**< [15:13] Discontinuous mode channel count                       */
      typedef RegisterBits< R, 16,  4 > DUALMOD;       /**< [19:16] Dual mode selection                                    */
      typedef RegisterBits< R, 22,  1 > JAWDEN;        /**< [22:22] Analog watchdog enable on injected channels            */
      typedef RegisterBits< R, 23,  1 > AWDEN;         /**< [23:23] Analog watchdog enable on regular channels             */
    };


    /**
     * ADC control register 2
     */
    template<typename R>
    struct __CR2
    : public R
    {
      typedef RegisterBits< R,  0,  1 > ADON;          /**< [ 0: 0] A/D Converter ON / OFF                                   */
      typedef RegisterBits< R,  1,  1 > CONT;          /**< [ 1: 1] Continuous Conversion                                    */
      typedef RegisterBits< R,  2,  1 > CAL;           /**< [ 2: 2] A/D Calibration                                          */
      typedef RegisterBits< R,  3,  1 > RSTCAL;        /**< [ 3: 3] Reset Calibration                                        */
      typedef RegisterBits< R,  8,  1 > DMA;           /**< [ 8: 8] Direct Memory access mode                                */
      typedef RegisterBits< R, 11,  1 > ALIGN;         /**< [11:11] Data Alignment                                           */
      typedef RegisterBits< R, 12,  3 > JEXTSEL;       /**< [14:12] External event select for injected group                 */
      typedef RegisterBits< R, 15,  1 > JEXTTRIG;      /**< [15:15] External Trigger Conversion mode for injected channels   */
      typedef RegisterBits< R, 17,  3 > EXTSEL;        /**< [19:17] External Event Select for regular group                  */
      typedef RegisterBits< R, 20,  1 > EXTTRIG;       /**< [20:20] External Trigger Conversion mode for regular channels    */
      typedef RegisterBits< R, 21,  1 > JSWSTART;      /**< [21:21] Start Conversion of injected channels                    */
      typedef RegisterBits< R, 22,  1 > SWSTART;       /**< [22:22] Start Conversion of regular channels                     */
      typedef RegisterBits< R, 23,  1 > TSVREFE;       /**< [23:23] Temperature Sensor and VREFINT Enable                    */
    };


    /**
     * ADC sample time register 1
     */
    template<typename R>
    struct __SMPR1
    : public R
    {
      typedef RegisterBits< R,  0,  3 > SMP10;         /**< [ 2: 0] Channel 10 Sample time selection   */
      typedef RegisterBits< R,  3,  3 > SMP11;         /**< [ 5: 3] Channel 11 Sample time selection   */
      typedef RegisterBits< R,  6,  3 > SMP12;         /**< [ 8: 6] Channel 12 Sample time selection   */
      typedef RegisterBits< R,  9,  3 > SMP13;         /**< [11: 9] Channel 13 Sample time selection   */
      typedef RegisterBits< R, 12,  3 > SMP14;         /**< [14:12] Channel 14 Sample time selection   */
      typedef RegisterBits< R, 15,  3 > SMP15;         /**< [17:15] Channel 15 Sample time selection   */
      typedef RegisterBits< R, 18,  3 > SMP16;         /**< [20:18] Channel 16 Sample time selection   */
      typedef RegisterBits< R, 21,  3 > SMP17;         /**< [23:21] Channel 17 Sample time selection   */
    };


    /**
     * ADC sample time register 2
     */
    template<typename R>
    struct __SMPR2
    : public R
    {
      typedef RegisterBits< R,  0,  3 > SMP0;          /**< [ 2: 0] Channel 0 Sample time selection   */
      typedef RegisterBits< R,  3,  3 > SMP1;          /**< [ 5: 3] Channel 1 Sample time selection   */
      typedef RegisterBits< R,  6,  3 > SMP2;          /**< [ 8: 6] Channel 2 Sample time selection   */
      typedef RegisterBits< R,  9,  3 > SMP3;          /**< [11: 9] Channel 3 Sample time selection   */
      typedef RegisterBits< R, 12,  3 > SMP4;          /**< [14:12] Channel 4 Sample time selection   */
      typedef RegisterBits< R, 15,  3 > SMP5;          /**< [17:15] Channel 5 Sample time selection   */
      typedef RegisterBits< R, 18,  3 > SMP6;          /**< [20:18] Channel 6 Sample time selection   */
      typedef RegisterBits< R, 21,  3 > SMP7;          /**< [23:21] Channel 7 Sample time selection   */
      typedef RegisterBits< R, 24,  3 > SMP8;          /**< [26:24] Channel 8 Sample time selection   */
      typedef RegisterBits< R, 27,  3 > SMP9;          /**< [29:27] Channel 9 Sample time selection   */
    };


    /**
     * ADC injected channel data offset register
     */
    template<typename R>
    struct __JOFR
    : public R
    {
      typedef RegisterBits< R,  0, 12 > JOFFSET;       /**< [11: 0] Data offset for injected channel 1   */
    };


    /**
     * ADC watchdog high threshold register
     */
    template<typename R>
    struct __HTR
    : public R
    {
      typedef RegisterBits< R,  0, 12 > HT;            /**< [11: 0] Analog watchdog high threshold   */
    };


    /**
     * ADC watchdog low threshold register
     */
    template<typename R>
    struct __LTR
    : public R
    {
      typedef RegisterBits< R,  0, 12 > LT;            /**< [11: 0] Analog watchdog low threshold   */
    };


    /**
     * ADC regular sequence register 1
     */
    template<typename R>
    struct __SQR1
    : public R
    {
      typedef RegisterBits< R,  0,  5 > SQ13;          /**< [ 4: 0] 13th conversion in regular sequence   */
      typedef RegisterBits< R,  5,  5 > SQ14;          /**< [ 9: 5] 14th conversion in regular sequence   */
      typedef RegisterBits< R, 10,  5 > SQ15;          /**< [14:10] 15th conversion in regular sequence   */
      typedef RegisterBits< R, 15,  5 > SQ16;          /**< [19:15] 16th conversion in regular sequence   */
      typedef RegisterBits< R, 20,  4 > L;             /**< [23:20] Regular channel sequence length       */
    };


    /**
     * ADC regular sequence register 2
     */
    template<typename R>
    struct __SQR2
    : public R
    {
      typedef RegisterBits< R,  0,  5 > SQ7;           /**< [ 4: 0] 7th conversion in regular sequence    */
      typedef RegisterBits< R,  5,  5 > SQ8;           /**< [ 9: 5] 8th conversion in regular sequence    */
      typedef RegisterBits< R, 10,  5 > SQ9;           /**< [14:10] 9th conversion in regular sequence    */
      typedef RegisterBits< R, 15,  5 > SQ10;          /**< [19:15] 10th conversion in regular sequence   */
      typedef RegisterBits< R, 20,  5 > SQ11;          /**< [24:20] 11th conversion in regular sequence   */
      typedef RegisterBits< R, 25,  5 > SQ12;          /**< [29:25] 12th conversion in regular sequence   */
    };


    /**
     * ADC regular sequence register 3
     */
    template<typename R>
    struct __SQR3
    : public R
    {
      typedef RegisterBits< R,  0,  5 > SQ1;           /**< [ 4: 0] 1st conversion in regular sequence   */
      typedef RegisterBits< R,  5,  5 > SQ2;           /**< [ 9: 5] 2nd conversion in regular sequence   */
      typedef RegisterBits< R, 10,  5 > SQ3;           /**< [14:10] 3rd conversion in regular sequence   */
      typedef RegisterBits< R, 15,  5 > SQ4;           /**< [19:15] 4th conversion in regular sequence   */
      typedef RegisterBits< R, 20,  5 > SQ5;           /**< [24:20] 5th conversion in regular sequence   */
      typedef RegisterBits< R, 25,  5 > SQ6;           /**< [29:25] 6th conversion in regular sequence   */
    };


    /**
     * ADC injected sequence register
     */
    template<typename R>
    struct __JSQR
    : public R
    {
      typedef RegisterBits< R,  0,  5 > JSQ1;          /**< [ 4: 0] 1st conversion in injected sequence   */
      typedef RegisterBits< R,  5,  5 > JSQ2;          /**< [ 9: 5] 2nd conversion in injected sequence   */
      typedef RegisterBits< R, 10,  5 > JSQ3;          /**< [14:10] 3rd conversion in injected sequence   */
      typedef RegisterBits< R, 15,  5 > JSQ4;          /**< [19:15] 4th conversion in injected sequence   */
      typedef RegisterBits< R, 20,  2 > JL;            /**< [21:20] Injected Sequence length)             */
    };


    /**
     * ADC injected data register 1
     */
    template<typename R>
    struct __JDR
    : public R
    {
      typedef RegisterBits< R,  0, 16 > JDATA;         /**< [15: 0] Injected data   */
    };

    /**
     * ADC regular data register
     */
    template<typename R>
    struct __DR
    : public R
    {
      typedef RegisterBits< R,  0, 16 > DATA;          /**< [15: 0] Regular data   */
      typedef RegisterBits< R, 16, 16 > ADC2DATA;      /**< [31:16] ADC2 data      */
    };


